{
  "modelo": "conv1d",
  "v_in": 30,
  "v_out": 90,
  "mae_train": 0.0012635383754968643,
  "mae_val": 0.0009226442198269069,
  "mae_test": 0.001269334345124662,
  "n_params": 37575,
  "best_epoch": 40,
  "epochs_run": 56,
  "hparams": {
    "arch": {
      "name": "sequential",
      "layers": [
        {
          "module": "keras.layers",
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              30,
              23
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "conv1d_input"
          },
          "registered_name": null
        },
        {
          "module": "keras.layers",
          "class_name": "Conv1D",
          "config": {
            "name": "conv1d",
            "trainable": true,
            "dtype": "float32",
            "batch_input_shape": [
              null,
              30,
              23
            ],
            "filters": 64,
            "kernel_size": [
              3
            ],
            "strides": [
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": {
              "module": "keras.regularizers",
              "class_name": "L2",
              "config": {
                "l2": 9.999999747378752e-05
              },
              "registered_name": null
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              30,
              23
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "batch_normalization",
            "trainable": true,
            "dtype": "float32",
            "axis": [
              2
            ],
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              30,
              64
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dropout",
          "config": {
            "name": "dropout",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.2,
            "noise_shape": null,
            "seed": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              30,
              64
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "MaxPooling1D",
          "config": {
            "name": "max_pooling1d",
            "trainable": true,
            "dtype": "float32",
            "strides": [
              2
            ],
            "pool_size": [
              2
            ],
            "padding": "valid",
            "data_format": "channels_last"
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              30,
              64
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Conv1D",
          "config": {
            "name": "conv1d_1",
            "trainable": true,
            "dtype": "float32",
            "filters": 128,
            "kernel_size": [
              3
            ],
            "strides": [
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": {
              "module": "keras.regularizers",
              "class_name": "L2",
              "config": {
                "l2": 9.999999747378752e-05
              },
              "registered_name": null
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              15,
              64
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "BatchNormalization",
          "config": {
            "name": "batch_normalization_1",
            "trainable": true,
            "dtype": "float32",
            "axis": [
              2
            ],
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "gamma_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "moving_mean_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "moving_variance_initializer": {
              "module": "keras.initializers",
              "class_name": "Ones",
              "config": {},
              "registered_name": null
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              15,
              128
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dropout",
          "config": {
            "name": "dropout_1",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.2,
            "noise_shape": null,
            "seed": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              15,
              128
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "GlobalAveragePooling1D",
          "config": {
            "name": "global_average_pooling1d",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last",
            "keepdims": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              15,
              128
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "dense",
            "trainable": true,
            "dtype": "float32",
            "units": 50,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": {
              "module": "keras.regularizers",
              "class_name": "L2",
              "config": {
                "l2": 9.999999747378752e-05
              },
              "registered_name": null
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              128
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dropout",
          "config": {
            "name": "dropout_2",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.35,
            "noise_shape": null,
            "seed": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              50
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "dtype": "float32",
            "units": 23,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              50
            ]
          }
        }
      ]
    },
    "optimizer": {
      "name": "Adam",
      "weight_decay": null,
      "clipnorm": null,
      "global_clipnorm": null,
      "clipvalue": null,
      "use_ema": false,
      "ema_momentum": 0.99,
      "ema_overwrite_frequency": null,
      "jit_compile": true,
      "is_legacy_optimizer": false,
      "learning_rate": 3.125000148429535e-05,
      "beta_1": 0.9,
      "beta_2": 0.999,
      "epsilon": 1e-07,
      "amsgrad": false
    },
    "extra": {
      "batch_size": 32,
      "patience": 15,
      "epochs_max": 100,
      "scaler": "standard"
    }
  },
  "timestamp": "2026-05-12T20:20:24",
  "improved_over_mae_val": null
}