{
  "modelo": "lstm_gru",
  "v_in": 90,
  "v_out": 90,
  "mae_train": 0.0012612228747457266,
  "mae_val": 0.0011067802552133799,
  "mae_test": 0.0012787788873538375,
  "n_params": 186647,
  "best_epoch": 77,
  "epochs_run": 301,
  "duration_seconds": 746.8,
  "hparams": {
    "arch": {
      "name": "functional_1",
      "trainable": true,
      "layers": [
        {
          "module": "keras.layers",
          "class_name": "InputLayer",
          "config": {
            "batch_shape": [
              null,
              90,
              23
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "input_layer_1",
            "optional": false
          },
          "registered_name": null,
          "name": "input_layer_1",
          "inbound_nodes": []
        },
        {
          "module": "keras.layers",
          "class_name": "LSTM",
          "config": {
            "name": "lstm_2",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "return_sequences": true,
            "return_state": false,
            "go_backwards": false,
            "stateful": false,
            "unroll": false,
            "zero_output_for_mask": false,
            "units": 128,
            "activation": "tanh",
            "recurrent_activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "recurrent_initializer": {
              "module": "keras.initializers",
              "class_name": "Orthogonal",
              "config": {
                "seed": null,
                "gain": 1.0
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "unit_forget_bias": true,
            "kernel_regularizer": null,
            "recurrent_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "recurrent_constraint": null,
            "bias_constraint": null,
            "dropout": 0.0,
            "recurrent_dropout": 0.0,
            "seed": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              90,
              23
            ]
          },
          "name": "lstm_2",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      90,
                      23
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "input_layer_1",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {
                "training": false,
                "mask": null
              }
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "GRU",
          "config": {
            "name": "gru_1",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "return_sequences": false,
            "return_state": false,
            "go_backwards": false,
            "stateful": false,
            "unroll": false,
            "zero_output_for_mask": false,
            "units": 128,
            "activation": "tanh",
            "recurrent_activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "recurrent_initializer": {
              "module": "keras.initializers",
              "class_name": "Orthogonal",
              "config": {
                "seed": null,
                "gain": 1.0
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "recurrent_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "recurrent_constraint": null,
            "bias_constraint": null,
            "dropout": 0.0,
            "recurrent_dropout": 0.0,
            "reset_after": true,
            "seed": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              90,
              128
            ]
          },
          "name": "gru_1",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      90,
                      128
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "lstm_2",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {
                "training": false,
                "mask": null
              }
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "dense_2",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "quantization_config": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              128
            ]
          },
          "name": "dense_2",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      128
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "gru_1",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {}
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Dropout",
          "config": {
            "name": "dropout_1",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "rate": 0.2,
            "seed": null,
            "noise_shape": null
          },
          "registered_name": null,
          "name": "dropout_1",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      64
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "dense_2",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {
                "training": false
              }
            }
          ]
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "dense_3",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "class_name": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registered_name": null
            },
            "units": 23,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "quantization_config": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              64
            ]
          },
          "name": "dense_3",
          "inbound_nodes": [
            {
              "args": [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      64
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "dropout_1",
                      0,
                      0
                    ]
                  }
                }
              ],
              "kwargs": {}
            }
          ]
        }
      ],
      "input_layers": [
        "input_layer_1",
        0,
        0
      ],
      "output_layers": [
        "dense_3",
        0,
        0
      ]
    },
    "optimizer": {
      "name": "adam",
      "learning_rate": 0.0005000000237487257,
      "weight_decay": null,
      "clipnorm": null,
      "global_clipnorm": null,
      "clipvalue": null,
      "use_ema": false,
      "ema_momentum": 0.99,
      "ema_overwrite_frequency": null,
      "loss_scale_factor": null,
      "gradient_accumulation_steps": null,
      "beta_1": 0.9,
      "beta_2": 0.999,
      "epsilon": 1e-07,
      "amsgrad": false
    },
    "extra": {
      "batch_size": 64,
      "patience": 300,
      "epochs_max": 5000,
      "scaler": "standard"
    }
  },
  "timestamp": "2026-05-17T22:08:39"
}